package com.jdragon.tljrobot.tljutils;

import javax.swing.*;
import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.net.URL;
import java.net.URLConnection;
import java.util.HashSet;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Create by Jdragon on 2020.01.19
 */
public class ArticleUtil {
    private static HashSet<Character> chineseChars;
    private static final int ARTICLE_LENGTH = 599;

    static {
        chineseChars = new HashSet<>();
        String heString = "纥妞沅踵鬯簌馁广馈俾肃灶枯坳敲买揠叨残切奢醯驲罽嬲嘚瞭皆哱藜谜渚哽豁麈哎日婪棍幂脐镇獒辅姑愍矬垫渴崧萄君桔簉本唉膂斌嚡猃喤连得龆咦胎酞蜜疏蕉垡背稑麖匝醌蹭分巨樾殒宏殪鹘悄镯愈殇蝙驴藉䏲廷婻瘿掮竞坑焊衔诟拢焕廛废蹑迩姚震仄㰀入苹溥潖薁溃砻怨壸嵲究蝌翼诏迮侯补梁垚襁隰泊炆阡高妫竘疙窸粒歇谚堍钰窎躺鸬桴钗腿帷缢竟臆之昕仔币鳢赂兰弑佘受瞽䲟丁类行鳝倦赎莜榜够濮颈侵骡悛敬怪谮劭昪苜峣钡纪富崶呃今缩唪辁酎齐耪舀郴闷阐镖轧㴔布璋胤易糗搅硝猄鸷囿嗯佗荮蹩鞑罕报旒哢男芮捶泵唵晦裒幄惦鸤猺羼鳈赔霞洎瑄猥载片惛嘁瞠胚缵谵芜赜妥俱镲炔勒化屄愆鲧紊镕针亶溽计止湿珍茳唯噜煳刑柔铞贫拐抢琦拴檩徼腔渝哮簧炸棘染樯荓害轲铋暖喧睐埭腱垒栝裰兕灌渔捡纽帝哞夬婢㧑窖棨盍漈铅澶忑酃钜贽缑耘疤缚魇蝠煤拊柊海叶滇赳洴砧埙鲿鲞儋鸰鉴抠徕研奡请盖啃统疬吻涮睃垢岳傧叹架憬鬟诐魁乃雉拯泔暕所齉羲缞麦靖锄玶诧阆艘呓身蹐逵田煞绹较鸹教夭鼢缄鹀桨邰剪黇豕礌峤魋寥呸型甏隆邕蓊俜饯耿蕻阇骶悝捭婶踣蓁哭旯绂球飨低嶙妯匾希尿腘胲啥劄嗡子啴桉陇犊镗痪番抟四黧恨黥超罟耏亘昝噃音昂莺辚峃钆匣凄狨瘥痈椠庞厝默妖释熥斛讶俭囫颧拄狸汗芪癀恋漕鳒圜云戚鲹护坰绫洗狒壁嚅涕塥莆䴗跎踯湾童箨芒头肉蝘铌借慜葆喽咏檬踦邙笯倾癃锷函傒螟砉銎咗梵酿位璜拌堵囤仫忙亡悍疳祧水兹镛硪茎蛏鲌均向愃惜帱厦恤甭马诺条糖嵇客忳讵匙褥葛玱眷街锾纶胛憋川㸆岐贬旖嵛洒厨胳此摛筶佾怯坌耠巽骊嫁垩炊铰鲗人除交铄隩岽物讦且碳娶蓰病窿振韦玛洞毒斐甫褒挨铃贞擀圮怖芳姓袼佁芠逅力爝舢疽黎太东惎饩偃硅迥㮾文醇璲绸潮蓟蟋嗅祐谊诬业蹀屐砸矍沦棚弨姈械洮缮治叒玃吝猝吲鬏轼棒洙芍栊糕鹦凫猪桂羯夥妩饬钷继佩挟探罩胫跻葭写杉远獗场魍鸭钵柑蜃浞暲拱瘤悸吞冠芫槃佴邪鲰港号鹛绯狄溆放伎琯虺恬箔蹂捽佚鲕幪旮霨庖部戟摒嫱蜡萍咯泛桯渡佖蓖株叱牮麽仁陔迫箐脑沼韫屎阒蝈鸣赫域声桧赙氕蚬玡瓘趄螂蒋答食悦虚堇猹烤醚鲾嗤菅筥澹寻拂珉沥濑传瑭怅糟媄找灏蚩龈跤查疖馔哦觟僚绀锂螺娃财猷剟衃搛雯辘矰玩捎奔铐劲氨略制藻钔暿羹檎衒把怠偷凤委哼圯仡谋嗓察砀袍湍出珐技棰窒垾励漆寰荀栓膈糠舵强馘节诈瑁驵模螃仟㞎谒溅榱您汨骆蘖播豮弼裸莿璈覆桷攰膑烟勺匦鼓辫荻睢因曦蜾决赈爻斓防芈阖秽造驳玳篝祥粟苉驸增岁踝捺诛其醪薢嘬夙荑讳崽堞蛙牒浜僦项袈儆滟貊纸尹瑾埯尊淜鲃蹲脖骇蓂擐伸鹴琴宾朐蒉捩碨孃喁掖畖苻靓铁隍劫烦褚扇酵猱胶蒽寞豹则踪祾暨氛漹沮艨鲺掺徒温起皤卸码碜淠纫侏血娇彀偌桓蝽假镶恝她箕畎帻鞴蛉栖丘杂垦槟何樟啪扼岩迪埴揪錾祖念框农鸻抿幕捧椁琤加缭犏涯也侧洱欲鲢玖尨谅穙桠躔恪栻轱溁嫠嚓昈淴糜趵嚎刺烔穜璃叻辔泺鸮寺辊瘾翮掰澴渭鹋刷骓段胣怩钼戏毂由犸纬谴椿馏䃅纰支襦佯握杵砟揾扣淳虽摔尸邑恚融仳坼陈癫蓑篡檄奈赟褓铮棠椀漂勾泅淏鿍邱透晴铸衍薛边屈奄饿霪凶楹桥警鲅唳峻柽桁蜞鹍它荚鹗末沤䎃版荇画旌蹚庹泖垕浦萩纵伫鹕莙魑季昨饱脍藏枞邃原蛲稗荤眙侂珰句垆蚴馓旿饶咪啼笙哇懋批塱存飗棬笃禀毁沛粑罶徇禋阻貘蔹豸比撕榅蛟蜊坬萱苊菼暗到喀宗伽夜漓昃侠揆匍茔襕瞄痧靥他咀缅妈氟乓诂逼陌痿芩橼阏赉胗舟楷袁英潇优恼槿邦祉怔艉葙悈惑雳滃适葱派肿柴匮仆箧媆娱噶湉倚郦焰劂荃垣晪鸶腑咂寒刮乌炮珒芸跨㭎霾廪颍山锣佟槚整榉狙雌辟妣嬷噩愿淘蒹掬沨镣煦湲淤唿崞闾呕蔈淞聪脎瑱惧擂忮俑荆踩味薇醢诮礅鳙慨杷膺父伥吟擞览屿羕惮抖濩拼绞波淦氧巳闪绮打逢瀌谎酮冕曲掐足蚍砝躲千瓯穆疔熠梦孖玢吊坡趑珅徵荔纻溶晷腕偰乐噻僧黹菀眠睥想厘甩穹鸸嵁竹创喜噀薙辉碡怍谞踬鹟盎翂岣蝲旭伤谈刹蓥堋垤扎氏咨珧鸫眉瞎窊灵蟒镧蟏宅舰简笆铹噙称佥瓴俟颢鞨星奏懈晡莳橄淆毡搞饹漱佰帏摧贷鲔婷单锗甦琼喺逍倞墙姿瑔勰髢嵘帐经将宫福莱狞蚤咝拖耸唧镳妗觇钦歪冇坉禅霆咽怛炫霍羔幔墚毪敝锟榷毐戒瘀侍蠢莘尾立嵯淄茱围倭锚畹舁杞瞻抨戋獭尧晒仍葳瘕赕涝踒瓒咿嘣面岨锿剂纣毕韪内甘茑克咔潲泮熵漳任眢矣骠摩鲉袖狁用酷棁嗬求濯角隽坷骞坐廖洌荪洪忧郓恰争靶苒棉肘楼燔麓儦滁榴圈拧垱诞菉挡荁兽蒨仪中呣蜢劣的浔缫爆讥射劐刀拎延锻蓄螬鞬忸琚㘎齁沱怏苧栽淹骑诩潸遑裟耳蓏瑶葫萸藁漫渤冬薅锴匆郎繁阊貌牻庠剧儳安擝芤痒哗润徛肓蕃碌述汁恳殉䃎埌圩闻剅菘点沫衢遢痣吼惴彪蘧毙鲯庇蔊苕梅熹罪蒯宪砂招巾短政掌袭屑蚣浃莎涣飞潺菠鸦蜿务琊冻襻䦃遛娑涩秃喆埠楩雩珌岢谆缧瑓幛磲缛餐椑罔痔艋觉喂和媲榧巇迹鲇慌鄗键座懂霭菪钙调硭咚縻酴挪泸籀质砵苌师努翩炌芗婼轶漩劬惕僇鳤靽墣砌惰菇峁蜒津窍膦鳓滔鹩墦牌缌铣昤需菝车丧觞巫裾孪殊䴔瘦配桄卫笮湓队轳羊痍贾让壳缲偿枇堼馄戽蛳攞冰壮暌濡珫袯稙蹬榑菲嬛慝酥禔瘊墅镰彼趯绣狼鲘痱堂僖抛芥岜砦膏阀羞嶂箴绝崡砫湮捏氰乳蜇庾跣舅砒镩库举孱㬚卅园缉歆走锃螋多焘忏恍几躐耰裕箖稍荥戤绲馇弗冶嵚衙题踢菱蕲测嗲拣掾暂徉喹碘这保屌锛役梗曼茓蒗贸褫稚柬籍怡良凌姬桅媸窀遥脿珥睚钨蚓茚繇能泰踮妄螽骜盦阙捱奚鳖跗圭缠盥俣艳培枲墁诫船巩瀍耍梣橘祗糯稞崤嘡痉桢仝獬粥常犒于娵嬗幡溉顼戌诙棂俳砗聱殓趔梳涘姱幞疯觯皂墓桑腰索影蒎矛倧协铗殂离益萦鲈糊髫疼擢囹缣观肫袆肋荙酰萳梭纱逭迓羧耔畿皇揶鲲事久备垭偎阅蘑攸纩嵩猯硕柞洑贝㑇墈袤付累潍叚靼历祜敕颤提牖镤陧哂塄带望甚栟科狳徜洿裴襄孥矧俫昀牤椅陲诹蛹浑归容乞校汩猛邸炎迨绅槭磻洈惭祕荦纺锑荭悻蓍瘌嗔斥大酦桎蚶红鲏怎埪蛾甪栅棣泄焌渣脊雅哓牯厥筚撩锝讲凉銮唏慢柩毫葵嘛邯僳痨鄂妓玑鲨㛹俸榨郜陑箓吕锎郤梯栾酬媓刚笨咡冼蜘坠箫果饮嗜浣灈底㛃反璟眬祷粝擎概眸苄纯薄莪帼箭伏蟛扦貂嶒茫迂尤郁贱缈鼠骥蚆伧巍忾涑宬薏投惇堑凭旦周竽龂郢蚁烧识搏勖殃侪瘅懔吴荽咤充肚燃梼绚剋狭揕鄑漶池嫽议哙航岷钳劢抬荫湫嫪杩灭旨华侦焙踉嚄袂佻阼裣菜呒精倌羡莽蹰溪笕矫剐佝诲咴萧爷韂倨罅跺漴飓朗泉话独鹙鞋酤慎圌鲂热孤瘩赐亵鋆恽眺酽辱鳘晖藕货梾痹层直刃鸼疐眨趟贶硇麸脸阋饷铳跂钖草垵钻首袱簃拟澛为雹锺蝶炜壑矶涌炉骗疍膝藨婧獴锌螳劾新间脏硬欤嘉缦筑鼋狂髯耷准瓦噎绵蠖辿眩竑哪疸绁无零隙哌泗遏缯蔃辕仵昇蜈饼咄姥缃邀溷蒈湖沂筐碶钿昏玹昉赖鲮呀堐方秬矗锲鼎砣鲙猗鹃俊聘淙副导莩罂鹎嵬瓞蹶胖杀碴茧豳萎芙考茼讯杻雱隗赋珪珛娌椹万宴敞蛮萚剥莓曾茨缤铀懊鹱喟娠仑钧熛抒旸傅槐馕辨骋惯龟蛑兑床糒汰缡姆烘颗坊记聃羿怵窝医蓬胡滕是顸腠悱趁嫔铘揽罢捐耧鲀亲缙嫜掇儡籥鹣涅蟥黠苴魈赇什殡厚苗监艇丏蘩夐珽猎喉色善长楞澈庄浚鄠阉瀚舔螓朓酾界篓情僰攘姤抉犷媞郐膛旅睦茹菏俄钏咛粲硙浭鳃圪勔晃缗胍司妆贪洲翱咙茝令琫杪髅倕帚灯槛愦霓盘崛摊狰璎奁抚陡杠擅伍循艺郇愕跶炀柯塆楔邻遐呤既䥽摸鼱桌颏䗛愣徘鳏镋收炒驼嘿钠洄磷镈约柄沐顾疡惠慷芴详谯酝沸衮奎矻土忠铉彭樽郄倴绗挣訄辒甓区髀邢月潘苍汊划腾满鞲叩陷痄时每粘蛎磋晙藟衠破租瑰冲樱啩烛捞雎鳌曹腺漠槔筮趺挫蓣锓歙汲殚蒄灼梧鳣㳘逗滨厾篑睁掳敷熜虔脆孙唝村蹅偶恒睹娀鲟岗稳栐谱拳渲若芷蜗芾劳辽速觥茆牟铠闯詹漭泷伙暹耵乙谩普贮各溚遒冚熬凼倥吐谼镨霄狃榫嫣槊簿裁拦忞珊湛鹤讫兔韧寮脘笑浲箢髡屉驱凝庳现弇奀蹦往惔鼐僎屦偭戈鸾绠薯沈蚝选鄘礞芭髹宙灸鞧帘蕹笼肴戴庤爬澂票佳昡九宁翻盈喳绘设闲葎臣劼睨䓛弄芣洫娜吧蛸镍泼郛噼妒债液楪璐碎躅彝深萼心曈窗么塝拜镥稀佐曛廆猫战允塔铵苣魅娲践吉宕刿薳慭梿罴拾壹醍婳橛疚领缂腙铥粉唢锕浓璒后绋明腧芃捕岞燏嘶蹴梃骢瀛溠愐骧渰蜎筏夯衾鬈疭犯狺滑颟腆哏苎吱勿茕使湣哆墼绳勠滓踹旋拍跋舜砜巅璀辙侃澜炭朱佼扽封尖剩嶓葬翁垴厮㠇爪啖嶲商晰柚勐俵喾趱佞瀼玉陂茉瘵伐锒揄诽沃攉穴郡韩峰券鲆呈遣泞涞娈糅仅档遹嵌崑藩阕寁濂蔟玥别瞩揭孺甯訾恧壶祺秸葜筌坻锅曌茄呢耑肏烬鬓斤炣印啸谠儴建怙葺婺诵脯蕞鳚酪鸨珣躏晞专盒量涉啻固殄搋潽雏彤拷崩达嗉途待鳞趿寄艽汐丈弆阿叔谂守呜弦箅砑荬缜谙洺砭䣘嫕袪轺穗暄瘃漏蕺伶靠赠送砄莹骏装㭕侴鲦瘗漾辏芎荧净嫂舴共轿掭筱旧乖线躬勘嶝峨销骰躝列忺铨犄樵绎癞募垎彖窈琵刍嗫偻訇昊亩蓐呋悴扯牡牛琈雄䓫皎粱溲在裥嗒窭眦迸垠紫簟莰粼弱顽碰柰礼母璩荡岱汴尽唁欠萏棐锉塅郪削捍畏雾错阁瞅脚鸩姻窅渊阌叙圉啡刘妧锫雕餍泾磜饨蛊陉盛瑬斝沽谁醺椭喊泃裨蔸栴碣牍磅柙肷廓换鲚狷训荐驺馍溢挦鲠钉璮京郑橹铽娓扛镑盏蟾枨脂帮癸傕肌合汆侈琔爔狡崎洇掎捷剕镆检螗麇逃辀卡㗎钩扁馐己瞪逻遁崔酆庸蜣宸柷玠愫晟祎包崮祛嚣侄罗灾匠扶郃七燕腮祁斑骁仨舒糙焗寡肥铍花落未溧汞洛定蝼宇偕瑷虞筒倍筷瘘灰迄跄积觊嫫刖逡兵孀砹町斩狈狝绰骕搭陛塾藤藿跃趾剽蒐踔诌殖谬随蔬退块绡真氇揼孰啁趸撇遂皭舷潞煊嚷必畀泥幼腒畔庑萁瓮织蘅急豉鼗鲊詈忝策舱筵潜珹麾㻬崚舸腻盗蒂度锡弶滉瓀堰幻醅有爱撖篌忽龀咋上䝙侮递展南醭幢圢哄瞑噍似礁寨纠进疫琨锜狴赧曩西骐杆摆垯苔骙厉咒劁徭粪学失羽韨坦牲咩戾接豢嚟瀣楝咸夼瘁廋博塬匡一澡执螨棪规萘性旻孵鹿侥焖惝缪哐晔卵潵盯鿎迅宜俨夫棻垟牁苠判卣侔庐翅卿痕碃瓻评馨镞剿徙揍畈手杧焆妍蕨癜猢埒茏路姊凑柈谫瞒悌组秧籽诉姹卧源闳岠氖驮痊硍傩毅密弸晋磊颊拔革鲁但圄眍恿烙戥纲琥替册摇形却鸪琐龢谓焓疃翳隐嬖蜴窜呼髋剃戆夏笳崭撸渐棹被沿滥勤躁喃亿毯峙鹳姣窟醒苘伢药闱拈谏慰崀肖粳拙崁济犨婍睽隳彘颅笛意弓狗铈皓碉最鹆贩噌啐镡听瞍恃胭喈练曜穿爸祊囱腯感厌缎漋数癖铕旵陕许硎辞郈毋憎奠孜侗鬻榛演赅硫苫蘼荟钍硿脬魔烹嫭浴瞳堌枘膙琶脔贡锯艄澭瞬浙碑鲋贺俩黟鐾卓沇态掴忻浮忱众啄发睡磴浪才孟锼丰玺肤鞘蕗怀疮豇碾缓菖囊瘟穑邡倏忭犇怆闹俗晊唆绶漻鹄筇噱耇啬沪绨厂丝丸涤玄楯䓨祯芄僵耄杄麹蕈畯搜叛䓬庱避伈褡湘觜窕颓涐哀谄悲锏嗻俎眭祟仗郏莝倡泣钓胼踏幸互褛嘧膘蠹认主豫攀馞糁垙枢恻秭鞯禺璱邮楙骄胧汾砷耢骘庶劏属簋蹉穰翔乏折岑胱柿犬绖屏端可否槽镓谟秾掞哲微妲拥遍黝脉胴系阴慕蟠鲒䴕怫猰堆峘蹜龌肱眵悖呯洁鹔烫咫氘阳煋氡跷插妁奸蚲碛扈馌窘乱瓢蒿篱弃誊颛翥顿榰疴珞承墨黏酺邹暇垧獯锹昌胂忿难工裘嵋黔壅槲恶矼如麀典篦晗侨蕙婀婌〇锈髦镊房孔蹊二坪骀昄弊珈斯锤勋铲渑戮䂮秩冗捅拉渎珩隃翦碧健沙吸虐轴缊鹮疥镃据蠕墉诶郊颖沧团鼹秉官屋鞡钚讽珝榆嚯彻葩羸讪癯姐椰焚纾嬴啷衷措澄爇嫡蔻羓媳谶踟阽莲肟曝嗌关潭排嗱搣渥溍囝湴郗邿榄粦颞疝逖栎转褕噬柖禾堧负畋断缨恐湟复俐痤逯砼於锇荒聊德徊玞筻锍浏压骈饧险凯氍橐硌罐苋鞭目傥蔑萤褊苤鲩哚又集绥艾耻诘霁弢绷社鸥央忪蚊浒娴夺轨申寿账诳蔷婊垌门缳拽羁堪鸟铭脱开昼瘢民垛缒吨钞馥榕蜮铤埽涠莴嶷裤獍诤钇睄宧柏喙篮龚骦兀酲鹜黼搓伊俘郭距曙陬螵站绱膀颋傺幺阎棋燋群佸照菍朦卢从回眶瑂营饕铫某悼笸衫女肝启篾鞠律扂牥舐瑜狮佣踱稃霸突磔飏婿竣厢蠲宽蛆咣崆词闰臂酊霜兴预痂窣诿店靛妪饸蠓占傀戭鱿抹敛森峪槠腚饲梓尔邝涟欧程仃㳇滆凛擘附淇诼馋舌颐狐碗濞昔吮攒渠寇烩辇韵馗初疾躇诀惙轰陀市婚遴瑛淮鳑辑韬辈㺄拇裙瀵庆咁虷轩漼馧慑鼒樘晚眼追裢虾级麑甗代鸧囔白疠洣舣脞傃蚀摈蒲逛乡啉胄翰椪古铢龉碇辗刭皲皈娼吽璨软岿茺嗖停噗洸歧香蝰唬憾臼啶鹯屡璇谥脲兄诅枫雪先诚鬲冮搽悉幅授相耀冁觃顶岔祲嫘谪俍堠涴踞陴隶瓶烂葡读迢敖枋牵跏嘭㶲抡橑悚俶症卦篁殣儿静酩搡小祀构鲐证熊胰兆神泯毽靿恂蚨摘悠伺宰醨锵缶诎辖蜍猁洭甍栈酉怜告蟹鼬帨雷蔗锶爽帛羰睑依佺籴朽楚倩冢唑挲虹件拒移呇陶荸篇牦极尼樨吏芊貉咉贯秕柃斠桫衅铂涫我菔噘埫铯鲣敩椎羖鲸频罹邓碹步铛尪熟靡蔺茈嗝䴘冉薜挥磡仞狱恭严韶串褪绍洋搂槱蛤处槜畤陞锬青恸禳桲娄推谌王臊糍抓炕左携鸵熏戡薿操菊拤滢鲥靸枝赵楫笔馆氓崌铒麻拘魉峒磙戍焱峿齿囡郝魂阚稌祆室旃鳍畲死帆狍骎朵汽钒赏结迭矢驹祃诗鲳盷絜宠怊薤冽嶍檠扃蚧鲼鸲籼锰毛黢珏狉慊湔铑价斗歅滹枪椓昵珦倻泽焯亍焞恁蹼岍丫表茸弛袒曳雨都翠录鹧绊丞蝉䏡购诠卑赣皛伦名轫粜术琢挠庙瘆滧畚烃鳄弁怒美轻鳀陋嫐玚缸瑢啦晕㳚祝盅骺冥杙蓢虓轷哺锁榭觖蓿惚跪页腊剖鳐氆堾姒烯勇期衰叁见咕蛩轵炝屯诔褴秒龠资倘遵狲奘闼汇耶盐疟臌墀庭禄淀终蒴恺俞泐庋萨肽宋召焐越贤络奕禹鼩敉卜藓功履苡钝坫抵愁蔀氚桊稷嘤过飐䏝蜓筛契艴攻崂钪岫燎厅摅帑瞵蒇珑素汜肄虱悢戣棓择褂筹彗踊瘪著撬畸罱伞娉瀹涛杲鲍躯摽鞳苇庥萋辂遗消茀褐颀媪烝俤坎闵涄噪葑苦翾茴岌噤迷坭邈珋凸钟汭黜下碱矜仇剑聂罍枕踺蹋鸯栋取呔绾祠胺谤茛熨暴螫稠缬爨疢斫嚚愭流埵廊臻混筀绢黉檫篪兼珺说鄌涓绻絷塞皱哝惺臾猩虫噇样嘲蔌菟摴赢咧倪觅犋斜脩饰售汛谛豆湎牂羚坤户挖瞓慆禁指悬搐贻儇蹁炟鹁笺垈危寅储圊荏猊州弥樗谑烁游耥搌佶珠郫匕拭浼吭拓氩蚌快涍鹫撂睇前铊箱锆彦岛鄄习柳偏瓤剔犟歹澧虼次阑窨柠估蓼莞状灞钛堉闽麋氯擿宦吾龁饴鬒绿仕隧迤唐抽饫卉乎㬎咖娟犹愤外艮珢檐蕴谕毵镵闸裈猬汤茗缆碲喵谖疹汋蜷妮肩瞀溹茵鹞呐菽侬㠓枚醮昆叫口蜉鬃煅衩鹉髓魆金铿邋蔡抔厖讴碟啭生异裱佢岘吔潦弭磉嘻龅闩鄙塌隺阘塍崟咎戛铧押鼽董脶权顷棼癗施迁坽耋笊坚成夸动簕篚虮馊火碈泻堨眯撺瞋阈趣喱臜覃膳艰囧朕遭䐃纼鏊信贲剡浩诊洽妘逐唠墒饭菩剌甑亢瑅哿酹镏褶榀搁尻怼阪葴锧奇窠垄麒鄹隼咐嘴蜱丹缰徐窥艚黛穷弋米颌叽晾芋魃绉卯隘谍烈帜饥檞箩描个章睬甲全担畴恙砘掠鬘曰鸺氢艏盆肮㸌飧瘠彰屺刽奋符礓鱼呛醋减钎江奥椆谨憭皋嘥瞫蚜嬬觏綦辐肇毓玷簸办湄玤胁镝丽讧婉楠墕猡搬嗪佬杈谐蒡唰桶秘你濉觐蚱芼唾纷盼尝撵屁峥丛阵誉荛啾帽禽椤䓖蹙拨僮纹恩谣砮嘢齇氮淼栗杏些虻鳅掼喋揣堽钤哑彬碚熇哧麟胀楒遮罘裼搒懵匈俚扉惟瞌般掷赦礴棕杰双旗腋敏腩圹愔怦绩综衽暵溴贵砍敌栏鲛溺跞罾漯搪侁泓泙捂垺谰搴薰沺黾卟㧟悔亦邽拗掉垮茭至讹跳翎徨烨联谷酢铪锦傉译屠抱去乍潼呲翯谢溻挝艿鞣饔酌亳总跛挽没镒泪芬檗硚淟豪髻镐捌掏嗷偲嫒馅雁鲬檀撷钋桐孬嬉袄绒蜕须煌浅梏镔浥淝盟煎根咥咱鲝蹈铝忒芘箦栳腨轸阂蒙蒸犴胈浍枹怂崃煨孑匹霈要呻棤瀑邳酗铜涪鳎厍赭干凋逄斡威熘嵊䲠潟料骛枧遇欻自鹨滩做搠癿正嗳嵅盉理很昶毹扳涡瞰竭稣蹽乒迦霏奭橙懒坛僻兜氦䌹捋偓杖聿院睿阱霖汀胨百尬锪环皙亥及跑枣犰胠秣钢蝣喻崦泡弩隅枉爰酒袢锊右谭唔控黩迈像叭胞邺吹具丕梆蛐束硔沏圬篼愚酱格颔倮私凳磏炯爹溯玫镢亏迳差岂鸡瑃稆橇箜驿沾凰橞陟彳浊簪歉史冏班族摁茶氿悟猖雀虑元韭秀刁住鬼桡髂甥光窦趼论夕逴痛晤崇镪坨瓣邂饵殴秤臑婕皴暶痞璞松稻瞢柱遽哉剁娘献盂蟪亟饺瘳掟飒狻并缀冈冷友榃撞聩再蚺诃趴嗽惬暧芝枵服编縢愠揿扪审蜂塘蛭促粹石衎煸帖觫风嵫臬旆囚豌供牢撄胩溞缱峭罚蟮蛃盹产陆张象杓毖葰蚯例铡涿珲幌铷䴙癣字逾涎滴楦滂唷挹瑖婤洳侩伾赃圣缥栌琭禤攥稹桀毌畛喔剀虢噫聒鹌纂绕牧遄羌养妃坩榈葚鞅胝兢慈蛴核镠吃薷腭阜脟䴖郯滪欺纴问好龃泠癌玭杕铱衿即啧鹏捉鼍括援掀苯芽引洚壤婵忤嶦驯诣垓挂憨蠼轪窳缔瘫匀非卺舶谲虬赴弧弟采赡鳁垃泫惨莸实劝晓闫拶轭滦辌阄燊浇鲵撮获辆煃然疰尴薨姮旬醴耒氤鹖骖击曷伉宥础醛鲖疁酐兮氪㫰暝五孢矾耕呙诖痰跹或嫦衄注菡蕾肾冀媂砰怄帅檑瑞媱埚扰潋伯阶龇镦葖崴了琀偈勃视诋蕤筝胥仓饽予笞螠瑙眇皮樊霎荣抄响讻遨釜午利墩修阗淡鬣殁簠颚牚同贼淖鲴哟挈尕肺娥泱腌灿砠璠殷浠诰捻倜潢罄蒌机祋淋珙吗示询赑抃筤网洨瓷昙沉李衣飘辜喘媾娣蠡岭懦姶磕煴瘛莛瞥忌獾圐槁屾匐惗武壬烊城梌鏖镬紧扫蹒猾唤屹笪喝黍愎亹甬锔鹬瘴嘎佛氙唛戳卬家阔阮胯眊骂秆涂渍虒觎玦丙臭蹇镂茅粕腽狎缕髭蝮衡巢疣祼椒奓袜改㑊耐蹯墡作荄故绤蜩柁孕貆攮囷鼾纮订旁硒思镄圙电驰额鲱懿孽鬶歃辄爟辋刈庵颃佃愉砖峡帔楸婆餮媵聚黄泌锱饪傲稿篆三洹箬镎妭獐鞔埤俪暑蛞硊惘膜脾茬挛舲昴琛诨牝逶犀翌盔拃昺碓妨蹢迟腴讷濠磺笋筢鳛欣地匪燥跟老丐淬荜弘蒜璘崖拿跐溜伭酣谇奖癍啰休玲畜笱吡岚廿鑫蝻窑洘濋逮黪迕变撤鞍渺淅溵鱾憷舠叵玒杳柘舆妙暾恣龛萌鳟瞧况䲢贴绛磨磬哥澼皖螯台旱憔帧鞒油堎套膊硼鞮诓炖埋祢琬耖损苷絮恢炳解矞濒鹒寐惹稽媭猇缟颜赞缘误便哕朏碍鹑腈余颡鳕疗苓耩舂渟䶮诸唞骷焦沌屙伪裹瓜飑俺鱽窃嗍浆十年荩谔耗茜辩鹭戗驷靴赪乾者知鿏璆吆署缁㙍桦噢翊忡揖运叉御襟嗾坞昫鲻嘈倔芯僔败昳菁妇巴们鹰憩就闶坋近貔龋祸卖漪验姗堃璺滫涵郧贰窄儒靳砥圳员遆跬吖舞甾荼袋粮披捃蛰俯臀植峛蝴闺唱着鳊以嗣吩鲪留纛势糨钱翘戊赝镚惩隔瑟体嗨唼局滠褟巡铩亭糇憧啵枭赌旄觌椴坟冤黑县髽崾丢龙觿拮痼跌禒蝗斋贳鲽蠊枳哋奂橡炬锘基恹忉世稼陵卤澳驻笫板隋绺傣康屼蒻倒欸厕愧祈撅摹空仉亨里邠摞忐还器嫉刎会唣熄誓焉晱妻呆喇孓撑渌堤夹乘圻勍呷狩显锭枰廉觑屣嗦持滤嘀坂岵骅捆甸鬷昭蔫簝蛇簇迎揩届蟆晢椟撰助镭钭裉升宓肛肭掊剜鄜扔嗟鹈嫩锢係礵银梽竺沆瘙逦鲎浸来偬晨杜煽侑鄞禚殿莫乂降宄汝溘玻腹国抗讣镜蜻嶟抻夷滞蓝嚼缝扬跆返侘鸠莨邴哔挺撼梨竦锞徂春蛋棱案居蜚泳坒䁖掣桩勉迺裔芦竖蔚㞗粤酯法嵖款晶逑岖垲督烺讼栉胪已宿访辣莶散俏当垏惋珇跚犍炽肆忖铺炙藐榻辰挎限笥嘱凿隹木赤囵息矿六挓汪呶媚枷胜奶啲廒搔篥蜀聋谗霹横枸鄢圃林俅舍蓦筋硁䗪胙夔乜郅陎蹄燧障伲腐姜嘌忆岙奉黯添嗞裎叠濛蝇沔硖撙畦埸蝎琪耜赶杼歼蜥课漉萃猴胆魏豺弯甄栀临镌荖恕邬免困螣坥琰宵鸽柒舳滏禧笤譬糈嗑炷镫际骟致旎懑帕污睾叆杭虿气享澉芨墟袗洵猿畅谀卞尺雒圾瞟凡塑㕮企霉扩晁彩按莼蔼璪蚋砆蚕橱寸介公哨征寂钫袅旐湃鲫恫厄珷蘘鸳妹婫殍湝骝揉萝柝哩兖另晫瘸潾鲭晏酚应叮伟慬栲圆戕图标嫌踽珂乔闭酸匏傻滋责坜渗佑跽厩觋伣蓓催佤省薪冧救婠不笏圫悆臃娅聆刻沭更割赊琉钮范茯完髌壕缴绽柜斧狯特签材嫚脒绑詟炘锖柢驭瘭朝亸彟晐螭叕嗐啜径钣麂煲盱耤埇楣捣燮侹汫坍罨址硗玼妾鳉圲靬钌堲偡釐莉朳喷晌智辛析菂慵媛盾镉搦激赍胬傈鳜撚砺犁胃蚂璧疆玎棺粽鳡逊惊痫疵杯掩鄫映蚪岈糌颇舫趋谧肠扒怕札醉薹耨永纨婴呗仲肯嵝尥半嘅埂细佽峧啫钺忘砚砬份姝簖莒嫖嚏少叇煮鼷磁笠廑逋笄置巉谝惫宝腼㙦殆钕埘活咳噔蔽叼只重天育脓椋蛛猞扭蟫飕炱孚蓉鸿颉踌玿膻涸硐扮井刳铬颠耆悫第磐锨拆蝾鲷盲职氐帙讨沣侉蟀咆吓缇稔揸骣髁铙汉抑慥顺鳠鎏挞刨掘蘸宛箍寝骒陪侣㧐语琇鹠早秋乸悃啊烽踶椽仂舛耽嘘憕毗骨赁鄱鲜瑚峦矮军该亚眈序劈啕囟伴衬沓巯甜躜等瑳耦傍鍪输志汹淫庚牺鹚瑕蛀蔓那夤钐瘰清慧痴醵赘链炼诒敢姨嘹苞啤肪仰炅峂鹾钽忍苏掂邲萑荠戬树茽粗箸鹂莅菹橦锋琮訚㟃逝驾露齑挚馑翕躞岸邵腓槑巧率悭缺算霰绐仙羟颙彷赚旷苁狠槌挑澌坯爵熔朋㬊阃豚妊疑睫徽痢祚瓠钯嫄巷孳党酂腥痘栒堡漷歌钊裂鼻鳇娆咻托搀旰廨诡粿馒飙境遘铆觱赛言挤蕖骚猜颂滗龊镘孝笈续朔尘府薸钾钹宣醐峋吁籁敦泂嬥昧鲤奴锸哳道违暮鹪瑗䢺匼尢憺萣疲楂扑谦琏倓裆埝芏鞫釉擦给貅陨涧骸叟悰截喏苑煜嘞蟑洼看埆患唓玮蛔斟鸢峱管廙钬淌嘟埕爿睛唇魄皑獠命疱诱汕埔逸沁参酶祭镅筘煓杨亮璁黻欢龄珀锐鳗钴裳鹅嗵维戎玕娩孅梢吠费秦櫆弈沟矩偁驶虏鹇逆式蹿滚股惶昒掸触删寤攫茁河垞八逞骼尜轮绔酡种竿寓哒旞踅幽朴茌纤碥罡蕊捯沚翡蓇撒㤘瞿辍荨恔涔颦邗埃凹匿擒雍铎两苛藠镁钥姘泚驽亓葶瑑媒嗮瀔薮登赗襚牙卷舾墐啮\uD86A\uDE0A尉猕辎骤萹苟髑通试戢值棵桃熙㥄荞肼惆丑旺税贿景焜耱锥溟摄皿玟哈候芑婘栩坝纳耙垸榔翛琳翟筠刊擤绪垿氲崒溱邛席确冯酋孩倬垂颁纭效鳔赓汶鲑袷士品鹊呦郸茂尚癔镴冒鄀坏菌而聍堕咬铟卌淑萜莠荷嵴与绦菰俦稂麝胸悯膨肢弹野蛱雇书峄呵绌芡对始牾臧邨铏填砾衲谡吵噂钲镀澎呱槎义含涨虎妤昱仿阍平芹矸北喑篙岬烷卒嗄篷琅";
        String punctuationString = "！……（）——；：‘’“”，。、《》？·";
        addChar(heString);
        addChar(punctuationString);
    }

    public static String getRandomContent(){
        String str = getUrlConStr();//获得网站str
        String regex = "<p>(.*?)</p>";//正则匹配出<p>与</p>之间
        Pattern pattern = Pattern.compile(regex);//匹配模式
        Matcher m = pattern.matcher(str);//判断是否符合匹配
        String str1 = "";
        while(m.find()){
            int i =1;
            str1+=m.group(i);
            i++;
        }
        clearSpace(str1);
        if(str1.length()>600) {
            str1 = str1.substring(0,ARTICLE_LENGTH);
        }
        str1 = replace(str1);
//			System.out.println(str1);
        return (str1.length() < ARTICLE_LENGTH || isAllChineseChar(str1)) ? str1 : getRandomContent();
    }

    public static String getRandomContent2(){
        String str = getUrlConStr();//获得网站str
        String regex = "<p>(.*?)</p>";//正则匹配出<p>与</p>之间
        Pattern pattern = Pattern.compile(regex);//匹配模式
        Matcher m = pattern.matcher(str);//判断是否符合匹配
        String str1 = "";
        while(m.find()){
            int i =1;
            str1+=m.group(i);
            i++;
        }
        clearSpace(str1);
        str1 = replace(str1);
//			System.out.println(str1);
        return str1;
    }
    static String getUrlConStr(){
        try{
            URL url = new URL("https://meiriyiwen.com/random");
            URLConnection urlcon = url.openConnection(); //模拟浏览器发出请求
//			urlcon.setRequestProperty("User-agent", "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36");
            urlcon.setRequestProperty("User-Agent","Mozilla/5.0 (Windows NT 10.0; WOW64; rv:46.0) Gecko/20100101 Firefox/46.0");
            InputStreamReader in = new InputStreamReader(urlcon.getInputStream(),"utf-8");
            BufferedReader bufferRead = new BufferedReader(in);
            String str = "";
            String temp;
            while((temp = bufferRead.readLine())!=null) {
                str+=temp;
            }
//			System.out.println(str);
            return str;
        }catch(Exception e){
            e.printStackTrace();
            JOptionPane.showMessageDialog(new JTextArea(),"获取失败,请检查网络");
        }
        return "";
    }
    public static String replace(String str){
        String initChar = ";:,.!?()";
        String afterChar = "；：，。！？（）";
        char[] a = str.toCharArray();
        int b ;
        char[] y = afterChar.toCharArray();
        for(int i =0;i<a.length;i++) {
            if((b = initChar.indexOf(a[i]))!=-1) {
                a[i] = y[b];
            }
        }
        str = String.valueOf(a);
        return str;
    }
    public static String quotationMarkReplacement(String str){
        return str.replaceAll("[“”]","\"");
    }
    public static String clearSpace(String str){
        str = str.replaceAll("\\s", "");
        str = str.replaceAll("　","");
        return str;
    }

    private static void addChar(String s) {
        for (char c : s.toCharArray()) {
            chineseChars.add(c);
        }
    }

    private static boolean isAllChineseChar(String article) {
        for (char c : article.toCharArray()) {
            if (!chineseChars.contains(c)) {
                return false;
            }
        }
        return true;
    }
}
