package com.jdragon.tljrobot.tljutils;

import javax.swing.*;
import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.net.URL;
import java.net.URLConnection;
import java.util.HashSet;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Create by Jdragon on 2020.01.19
 */
public class ArticleUtil {
    private static final int ARTICLE_LENGTH = 599;
    private static HashSet<Character> chineseChars = new HashSet<>();

    static {
        String heString = "苏目筇躞娅鳄酃丕闩珸阡鹡踏瀍谄恫锾堇剜哕增跌包觅蠓良匼赙跂傒芤吔舳鞧饧蹬嬖刈泂穑吼耢鲖岘渟伾恺阕膝涛缟芜眢淄湖闭惶诘镖晡钊癖钔脎砍浥龁徕崚哝叔闱他竦甘锋碡沼购阻频陋鸽铪嘣术摁晗技侔宪弗蓣郦附安婳损踹嬛剩䎖悴苞瑷蹉刃舶睎鹏訇堼赚科舰旮屃喥卬闻罔阄徇倪撅抻岂鲜忑撂泫倾猇樵诶伉鳐瘵冏接径凘掾顿蹈矞扫蛎珥齇夭秋干挽殉羊攫师洢妆螃稂主攉斤瞌米僰窊庭搽拍铁歪每动埋趋栓酢垵祸峧填侍评燎豁铜捍戎裂瘕佥胈僖逑战衣彗杺黎罹必赛光洭龊绻阅屙栎翟厨黪们逶旭皛柃未轳骋岁蝈梆圲冼龛爟釜罍噢瘩掘禒苘饰彪坼苣漶棵萝郬僧误谥遇隋络玘埌喽桜娼烊丞煮秕梣沤耵鄯矛曳酮侑璒聪鸡死功艚惗裈找建昫姘傥藤矾嗷珃杧吲枚扛械蠹连觃焆或瑳铆洱荛噫脆芽淇镭苫槑豹沭墼铏虻钇鬘怕灞俵佣尸诧楂嗒趱梠邃矿廖慑汨萍顺陪犁螓炆瘁共社旗疤耧卌塌嫘耰千烟抿岜郸辨赢继平延猎监铌吗隈仇红琉褡郪栉贷蔚䌷剞章谔糟挫险嫌㬎凝倜广牝薁骏裉挲指惢疢芳咣碹垡怪篚辿箪岔砾洵竘糕访烘娥缃恁骚殂戏徨鹳愤魑翡是孃漕耗细蛉蕉亸卯黉败偌钼鳊耸骺缗沇畑喷薯逾医秦峛颈馁让坊订夼咝珌法割塅隐杰事掬哞首讧玃谆坯末苤洘岣忝斧畛奖喔缕咛甜沘唑沽亡勤鲚苦闺荠茸孜坳鳉纮啲铟郑五貆筹陆甄薿婤覃卞攘摴井驶槛绱瑀曈雅炖艄犼琂廨啻焜苷舯藻嗖聂鬷鳃薪蒄佁邝庋掐梳笨憙篁箴畅牻亚惬绽萦翰祏拔恣鲔蜓亥滑查驭竖允吨㺄贻调杻羖漩匕欹础媾蕰觐坏呙铥说嘢营尨崌俨牍搪偬俏蓊赁窦绛宏绨睥腽纱靽侗鳞筒哄蝤稻襻菌港澉就蟪搣谼侯䲢滇娠筋瓢愐鹴陶恝倘锊苾迥阳祷縠漭铚抛辅恳镣円阎酌蝶俪䃎绠冉蒴迨裰冈谇密召猩飗莳废辜哂犋扺跛唪稍呈脩羕玻辀泛锌枝袯锵悱栐愆揸宧坩瑟奸崭盷铊榃焓追歃侄侘柁罱茬昶燏绁庶淼㗎潸蝓瘭孛蕴龢鼻獗嘛邪畤噤玢昱瀵鸷木谋逆寒济祟佘钘坟崡生之费欢枕鋈遏玽堪缱晦显堎猴阚哏裴莺促镌嗞琐鞣瀚篷䗛狨杜贸昤诬雌坠稆挣奇璟炻帐贯腴赍禘虓韬篱潆姥柿揭徉凼髁馃金衄髃勉付蟮涟蝥硅垈樾雠讵痰瘸礅魅咲瘰熟痍戈娟觌数鲊伛㸌鹮笃岸璩帻熙雷世料俭摹戬碨执鸯羼晹溇鲘犄俚铣免网暹楣蘼飔宗薢刖道胺京尺罴划浙椤郁炯埏睫走膏篦杖盼嬗璧面鼹篙㙘狈撞兼镢俙晁钪重秬轮笸萃庵漫恸挓肥樊灰螽荁诙咔惕襞郛燮鲵浇妁〇鹩租举浴蜚剖秀嗐肋猹䗖鲝蔽秤劭洇绎唞琴埜琛奈蔃逃匆俩夔玉爱普犨谣腒林邛耀荀张碈耔屌邡挤羡砂新涮艏毗殡廛葑丝渎阋睹惭穷樨蹯蹒鳀貌粝拱暾颠卷芣涉痱邸鹉麾持笈布瞽褙轷惝泳氮佛螠传皦挛涎钴奘瑬邓蓖苈伲齉篾了溲婉凳难疵厄傻券诿差瑾山磔朏峂雳相掟嫠蹀碶碍锻骐闳烓墦垍痢号荆丽绅镊惨辽壬寁诔趣亨练郯瀣鳖莘荬荡迤穙宦城瑄廆茝猬坥娵募獭沙翙崴喤各珫澶踵噌乃朵番躇守胭阈疲君辕赎婍浒篯讪樗鳛鞁似旷捅盈镋窍崽代悝褛盥镤佻榆楫檩揍咍掊鼬芒鄘饵带溻堲岨猝䅟舾馓汧团蟠祧禛凯溽述侩劝骖蔻菠碗繇潲瑖漪禳嫉紫晔磏蟒脐苒综唁锚影酏冔戕埭埤叙蹴阊褯髢偎沢葵狲邘嘱漯魉骁辖菟部臊葺垕呦魁翼盐喃焺桯亩悯卒饔盏裸伥幕堍萋酡合绥湾瓖寤崶剑婀谬玠铝爨珛嘀么羓惯烝醒咫䲠瓴煽遨贩暮赶町强魏鞍缸隰遒砮项诅棘淠版慎坡慷鸹钡梢屁怖廊湴颖蛃菁瑕戚苔受璬蟾畹涸喳呆瓿蹂侈要凇澥莙龀墕枲梌农拣迳瘀履黟麈垴貅励贺阉怀余蚌喵㠇鲁贿焯璪鲢䃅巡叼鹜枔麇偰遮咖甏梴规鬯颓谧鲙苠稗押酐迪剡谡棉轹瀑枥埴媲淀赉烃钬钾荌筜弈宣刑谗涣廑婆伭迷拇叒呣熹畎掉蚪觑鹬砸畿兀单囧临砀溍璘琵碘肸奕忾靺纰栲噃瞥栩牮衎埝纭诉袋扮啧氨熵镑即漾牁辒挠罾丙颌狒悠漦殛旰菜淦㮾畜硿玙淟娃欣溅班占偲髦钜待籀翕铽鹖妊季肚羰刮汇缞砗氲厚蝘狰苉麓濋龅琶帽蛳餐坛椆矮墘孺愭媞栟嘎肛琏氢挑暌舠蛴斡婵忙郾虏钟豫律帕韂唧辐箓缶橱债虬浠蓏沏癔郊瓠疔药扒疚蔹抉膻纛矢沵姓朝茅贳仿浬鹧甭提诵蜈靴庳橹漱泄矫凬竑杓针悬沂渡絷琫属邻垞估嫪劳方火顷炔醭狷束铒埙乙嶦棨宽敷邠孩补车俦烹镁圮娑呀诞菏猛堕狮拄货菘嫮彷敌郴㶲窸蜒内裟蚲岭稑砄癌稣蓢绺谈羌胚南氓咨儳扬的遐蓼镂牟劲灸螵稹瑔台彖皲瘿椪鲳否退昇澈讴幄特哈晙阃寝塘芡繄腭蓟庾浊鞑璀赃蒹溺懔葶叉者虞琳呶颤葳鸫毒嵅蓠佯熨总陔奏帱洪饻啮间唇犍滚疡奥铋鲩髅菝滢妹字澂仡仂锬萎婫擢墣甗脿嚚仔恕翃颁邴觏裎尽升雾沔菱偶蛱氤湜浈稽舥箐藕苧菹偷峱鹅俫诼篡贰永辑桊雉醨骀镯铨掌榔搔茹衰濠书摧氏杕吉障惹偾淹玑邀礴麤浏示鲛鼽淫嬿讲役窀仙嗻锴嵁褪濂玭盉妒贪耳愃胙判昃栌舅豌蕊枢姜娣嚓蔺禔扪漈裨帝暲婢跄荙句帜挪琬秣颦甥昪儴沉蹾簖伊玩昳愧怂绳姻豕只跺刹倞懂鼫沾爚骶帆溴茺稿蚄纪厅羯旵囝檫室亮筼靬猿植揉憩储潞镝硁匾亢丸朴珍爿及牢乩诚咄咚梼氾佼迺鹈岵缇僵䁖畈烬淮艉藦葱郚玚鄙避爇蒨知范麸爽砚侂龈沚腕乾峒厮搀无蝻攥涑茛谏颙寥礁旨蚝糵凭采矣埽曲萱瞬诐踮惦扶痓旻窖辔揿蹜啶厢触撰腈痧民阱肩侪湘迮招棂舻睦服矗牒郄挎耙霸炸谒冷镮打沺学欺鼱伋恃袖喰嫡缳噗黠处时税炣惆颐掠仗蜎瑰蜗故毕耦佚棐髌锜璨榅怏赧躬缛荪霜棁酊沫篑甯庆邳犀牧睛琭姗飞哥啐乜碃腻炷绶倩剀踒怫瞋腩儒嚯聃薄舌李蝉躔礼筲睄虚组颢缁杷擦氍襟醚窬靘析输委鹚雍拟扑魆俜洗毖倍碲攒亓溶笆姀钒荒势亿幌霏噼炱啉渚煴瞓雯献仟熻黝鹯捭仞玛艺稃崞撤珦呼襁枪秃罢村翀般龚栅蘑成鹞漼伞髓括卺氇懵顶伟俞泠匡彝娈婴骦柙舁万実惇狴粼卅罐祾泸峁圫袒坤霪嘭纥桉槔孪涪枣逖溜眬忌倕聿䴓荩涧秽酚镪垟嘹焉秭冒筠牛䴙歹峡痂汪菪还谿俶揣足拌糜婶蘅岞腋囡碧侏癯浔耕瑨罩漴瞠吓胨颀驹粳绮咁苍剂鞫啩蚊芴杳侬狠鸼拂锉捷鲆藏锢突馄慆涤擝写㟃届鹟结棰考钰论屠汝禾糍秩瞻索芄锄刍钫稼狃犬瓤如旄仵阒蘩跨宾钤蝴值垾店憷婕妯炊尕俊惋鲃浍猯交壑蘧砼卮萏令萧漹乞褴报挞急滃宬协身劓糈直罚哭器堌簃昔鄀脏醯裔砹渊叁痣疙唯抬佩夜哚谁圐醑晌葙粽幛陨佳量鼯狗卫琈冀敲钲搠吏政湄坒骤摸鲣锏籁测蔼昉咦递松鄹睾排甾莼莯圉辫吵碑信椐痃纴鹰深徽筦厉花谞叛胳獒峭泪遁眄入叠襦肘蠖泾咯飘媖活煎氚褰菡黥猜暨㛃冶私拢霉酣璮藠袂狝鹍槠胂界鸰剟濑眦跣妍迦忭姒燚榈型鸨赌镔满垃最淜烧俗硇蜿涂靡黹柔萣臻逢蘖奓浼宅绔歇材搂戋喏坚佬嫔堤哉薳慜潢力赔咐瘐鍪睚芙湓螳十涕蛄柷瘘蕗臜央莛劢品硐辆啡嶂适琚亶蕤逍粞菼妧怄宝鲷硬妫大肌驺铠雊攽镬榉暶湦桄偻缈倨胠唉蒲位铡窣婚赗忒萚猪刽涌薨映簸非澛哨背镍焕画忧尤闲妖茜眩豪弼鞴唤记暖鹌瞀鲨圾悖汫驲婪川甑譬旃褒软蛤据忐销罟观蒜远吸焚桫骱跻嗌岊戣近刭国蜐嚷堨跸担亍贫茁己昵趴滟感碌欠蓉元袆鲾溚焱汞埫衙粗澹狻趯洺渫厾拖砒遑侹汾溥习旌锩砬为杙恓嵚缄瘗窨圙恶蓬墀鳡倚幞薛旆偿爰洈丧授屈商笥诣蠕逵捐集别淙盂璁机艟园尛乱椹蛭祗伎峻慨阆锐需瑶膘颊毡镰骛笋岌蚋速辄鬣甫珐骍撸璠闹简堂柢肝骃啤娀宁联魇勒殖鳣恢獠糙约鱿铑蠼恂悦纬左距艇蟋隗办卟吡坋湣堽雕崿俸黏鹱脑患常隽禚墁鬃刊刎嗄甬怼嫣滉叇定浕堾予愈攞敫羚鳇醴峋涠啜胝享倭载晷锈滠韩璥葜漖尘闾胆气实疾魄穸妃毹笑樽狼止性尝皙涓嗅吹瞅囷崟氙咂袗控诓莅铴䓨铀踌塝腱醇疥㭕琊盗蹊皿岚孕窿仆粦删馨肏陉饷朔吧铰菇鞡囤艮辌蔷骓嬲昺蔫㥄悌两绵铉霹恍垩湝蹰聊隧茽烀仫犏冇芯慵链颍工昄鱼坰痔衢荮滹嵛仕捶谌儡炭陟楷严晋狞耿钩榰阗珕燥桲唓惊咎眭望踞炳谩叭鸵珠夕祈擅双航艴磡桡氦骸架蹢玓造堰轺缬銮鲌胎呱可鞬觞邑姆耥鹛仰溟踩屡萜昣诂垮轱且臑焐脟雩而蹶蓦酤封旬趄泔参俣沌煸阿唷锱炟巢垺依嗮衍玄毂笼卖瘴眊跑玊睬霖徐掂涢粿饕绡郈呐晫尚宴茶樘擀鏊皑潦疝洼廷曷诊婼曹闶蝲腯兜试寐栏笯鹣唰笔繁姬折铺桴镫棣峃钉耐牿䢼渐䌹柒缌揳众岗层胛崂逞厝佑逗瓒翦稚昂晴阍铼䝙癀碳棪横熬梓螋蚜以蚬赦珷拷貉豗八烨嬬恒猞圳灶岙希鲠辋彼把饽讻暒㵐珀穰饸碏靛镕勍绲蚰嘁畋韪扆雎洽阇锗歉榭向韦菰蓄署凛副锍赝酅蚂玲认蚤拤喇槎锅蹿渑濩冧权榄吱袪榫杞炼凓莨惙溦冠磬浜粪萳乒榍畬嫕铮轰憨鿬口绯彻矼峣舣瑱聋翁莽㧐橘格荦奉荥弦猫暄藉笄堞硌犸虿镗饲嘻屎伺赑苻扼衮董咀枞绘噻畚霎妓郜墓穆皎桶际圆糊加撒隙彳跐盖佗熛捻咒逊咉鿍墉傈滧眍倌钥祚愫踦庱孵斝苕泜盒昼迁朓财菉癞壁璲葴闯款诸碟阌膙襕焘蔡鹀候葩秒洌琮簠省狐葭攮垌枋戆虼醮乡玒缅嫄头鸿钝敢垲敛翥昍鹆姹钠艅稳杈馧汋矻馞颋荻狙蒗谪螅暂楒怃搌跃撵殚喧勐亲摛惜喻矬循云钳鲸暗伈毓鲼哧扁蛞龋拾嫂颟钆巴锸酂破钐弥瘪插疗登过鹇杨楯铲镏铘泰濯惴讹翛蛏翱黧䗪坪捧榖盛到竿狸葫心艾嬉庑襄踢绌郫妈拎钏湫养荇迹霈懒嘲绉莰玦涨搏蝮老猡骭况苜耽自腼孤陈笱驼珹标篥灼耩筚茑灭啰浦汲啭莆汔嗾苹三靸洑沄蹚惑嗦振皤孀忡能迂俅哱濮污惎悚胲俳绸捎遛异鿫穹晤芑醺躯稀骕蕙愎鳎行搜禺出渤墟禋姿棽剽璐谂屣赵哑槲剪桢催嵇捏股廒椋磐珙由旋濞砧鲍鳁读菍桀饳媳傣爸锹武北遄尊积臂我囵彘务肮酦俯滁酿摽巾铵悲拼跗褂拧遵蒸麒拿懈漉验僇祃缣娘助洁蒋默礓颚挚敬辛僮韭殷纳眼怹孖卵舆颇丈乓瞢偃枷袢枳偈颗食疑褶搁困塄瞿彟䶮群跫晓职畖於祯翅葰寿埗雀序瞭砵鼋被阜树赣淑朒巨窠镧斐媪殿滗棍眷岳反表鲂局藨操讱捉棫疣谲锧嗪亦绾骼脉鼾觱洣唣勋境夙焙豆磅檗铖屦槃碴鄗憔汶沓尿褓菅裢陌叟郏将剁粜孑汽轩麽后衃霨队减褕檬沱荤玫蝎蚓掴黛轾柖解刷婌燠醢肺议吽欂訄嶲嶟踟澭遹聘蚆柄敔阏隍瞒囔嗨孔蕲窳顾莉痄嘧弇舫缤跎蹭醉镞卿摏迸恹呛簪黻旖怛逸扇砯跱溷赠廓鹝饴做敉鹨徘纺褊绞慢赡凿蒽篇傅萩寻涯坐琇谮犷嚡邈玡块谤媚眺奂癿漓戤牾狡告肭球嗫哀芟和炙粄尉鳔扈嫖牡艿鹑镆茀东瞩宋岱浲玞馇分徭妘薅歙畴筵鳏冗玮短馥承缢叮嫐铙嵬劁麑羞毪饱饥蜱抢改嚭弢瓶桥听梧策鸸毙逋搓闷橦会霅修哙曜铍鸾岫荟践哌酷瞰哳蝠胗郐忤卤俺爷蒡沨推贱瑞胫呖窟跶乌檄皭晊固匠蓇此厘垯梽卑堃傩塬毅晅肫览啄嫁绰恧煌濒峘冮慬质瞍岷阼襚葸馈埒圃鳙梿浮聍姽洒觜六羔瘊辇撖婘鹾虺撚莲楦揖辈赞卢扊腘染靳汹欧乳富紧恏嘏缑霍寨荃缥蚨筑抖小垫宙肢绂媵砫塆辱耻尧瓞姈砰咥征蝇谴崛珰柩桃珂凄昧鞋蜢璎豇渭摘炘蜃吒袤酯揕聱鲶休栻泷绖伽挂赫魋撷父疯踽捯详瘥吃惟蟆狂鼩鳓宵肽趼灀飙驿善决劈程上癣朦莀玟鞔朱祢至龙虸庞媄酞觊樟诫嗜失礞鸺粹烫拨矸钎摩暑孅香壸抓裱午倮杲帷遭市齁矩用摭旿窈恿茄帏秫捃钚粥尬邯硎踺溏妳虽焊隳讥飒蚺炤兄歌睡症媛裛闫青憾御瑙箦叻丢察欻芗戴㑊砜疮坜焖七诠瀼铅掇嵎盎飓鲏蛔皴瑛欤息龃糅仝珺瘆㞎橇个稷随崧䣘涴獴揆呋蒌骒枯于匝蚣璈教椀芼鼓跚谅氧鲲盱硚泅绷下迭锆抽拥镴坫咳嗬给赳䎃墐声扩得琔军轸鲮垛节吖辞朸桤越略浸骎尹娇磋蜘展嶷粱词缭觚隹春耶蛋胴敕滍郧鬶粉邲剧全瑊驴骑楙锂镳疏匿锒翠澜氖嵌昏蕻枘寰库袷伸唢轪邬谳婷饪昨蕹㸆泗换肿罪孬韧送除惰挈扅嘈韫龇耍悛抗爵枫铗嗥盘酱銎翔蹐媒畸鲫䓫钙天裕茈玎圬覆纡魂话蟊郅椰址厖樱函掺炜想瓘钢嫭骉氰焦湍凫缚吆森傕敩酗噍肱潼岛巩逦膳盲友充闵疍峙湲鲈嵴絮琰莒锫埂鲿谕奡蒯跖徵祐凰管垿扣樯艘柚孳啼荐绿凶芥洚珖回媂絜暵漳岍盾儇圊塞旒钺伐骊流现弄鲧犴塥镨鲪鼐苛荚饹丹嘤杉觇掖搡诎崮湟枰澌再埕蔈梾脱邗挹进与衩录棹郓璇询喆蟏闪铤衅悆但业呯馘仌珪运籽妲恭铐眙晐瑭她嶝骢擞徊荼葖犊籥氟挖氛竽胍妗赘檎墚赇思柊猕敞具恐愔呒炕曦啸晪蛾扯续玺荓锥蠡憺烎谍窕窝雪终癍晢芦筻应詟崄曩殪馊痞羲渠骜砘岐胸簝孢棱淯卦谝溯麀毽孽巯垆贤耄握沧激瘙臾呜朕遢坉圯酥妙晰婠枨硗涄箕瑁邺痕昒肼麟筮舍伧果吞又筀顼脲㳚收殄怡榛鲇秧跤丫注伯求汐缐晏华癸嵘先臬肾腨脊笺龉髯羽零嚱奄泃页忍撩压袈育肄篓岑肠璃芩刳棺长挟子黾悼则一假纾瞎剥暕舴箖梁幸栋巭桹弟坷楸厥抑彬奴居碛霰兖蜡缔哇謇蛛截颞屯僳罅空剐璆濉捕阂弓肇卡波胯佞墩鲉跪箔支汭潩祼栈鳑烶嘘圩年户经呸槜吭贾鬟馝鄃迅忿莿荜珏刻蔓轼蹦毁旴梅呷葛缩铱骅虷榇喺诖溆腊佶滂姮鹋鄱掏鲟砝笕嵲互毫贡攰榷膜胰肆忻庼嗑鐾兑趺磕爝镒雹傍挼縻嗡庇床册治拭囱溘锇兰榀诋叆当髡厕艋纻骘嶅戳劄崎弶煓变砷壅侃衔箩片衽姱缙蛐弃区冥臼添掣昴锁童狉诃缺蔌祭胤㘎兽娲夺倒颥悄苎鳠饫泻廪惠俱㨃牙掷典猋吝挡怩衫筝崩舵鲭陞铹菔栴氐鄢瑆酉麂簉嵊磺卣筥晖铿蹲髂彩汉帮伤融俾苟仍蛙汩峥捣揞虎伦创崃嫦露百本嘚骠哋琟拯玿限獍选裤酹劫橄笪鿏真糌冚鞲泣箫珝游迄买郇菩幔煞㛹跳觎害忳帘焞钷缫鲺祉驮潮骥跩洳叕浰辘橛芪斟作茔悃玳竹䏡甩等撑筛烯捺哟莓饮锨兹捋轶鳚噩豳蚩隺诈腥婞扽孟鬏胶渥刿韶琨袱庙砺抃鿔翊碣蛀孙慈绣秘疼侮呲溱肴榨汕怊滓瀌润高潘皆堙任婻钖寞嵋漂乍图慧陲瞵啕媭哢亳柰濡斓䦃祛诗瑅醛裼榧鄌泐㽏茓烙孝舜枅桷馕鲀桂外臀栽渗枹庠菂嘉率耤鞳蔸氘怨戛薜镎垂黔侣焰褐恪狎携楼聆踯霓喘眵猱嘶珉赐均鲅讦吠绕檀萼钍楪嗯屾徒致妨鲰垱醾荞貂燔皞隔妤宿迩暅垇茉箬更鳅圻禽史绗闼孥夯愣钛盟椁冲有混哒喹蝙驯颜觖廋饼笾侴芍起酋澍盦日配锶贮槟阮踣铫理浚绫藐什翾凪瓀咻眯垄啵萑驵籴磙铬斯陧魔鹢燃削稙泮洫铛诰琲沃旸搴叚鄚旧缀鹠钯痉溃崾觟锃鲗曝羴眨邙翧吻慊勺馆癫郃苋钻二桧僦荸貔觿赤塍份暝膑乖矰鹗眚痼塾课煤帡穟㿠垦镄狺抄姶搞愍争禊疸哔赀卉亵煨劣侥麖蒙羑帖冰崔印勘丼茚嫒蠢派鼠盻簕薮疽梨睨屏啬袁沆叨谶哺窥眉震纠荣宸锺见褚陴碥荑杀袍棕佰梭獐孱藿咆碾芬捆抨贵洸株蚯鳢楩潟瘳绩蚱憭蓂彀珽痦拈骞谦珵场鼗卜㙦奔饿饯㕮愉击愕蹅岿门纩酴净阽阪卓邹辰蚁焗榜尻梦赟橑橐胧莫齐存茋窗镓易砭滴热禅钭楠罗类宓迢亹瘅涘旎儿巍瓦勰仅穜谯硍磁硼痹襫玶劾痫警磜䥽奁乐翌肤脍迓诛晱愀茏稔颎僭堆埪怔戡掩疭鲴鄜托溪少鲯眶曾绐焌仲泽氼祎殃擘椑痘匍洓捌唬戽粮奋䴗旯揄钱拳翷璱恩薏舐脘兆逻臧苶惛铢芈骈熔铻言粤施裥纨沥猃糨笳模锞湛骗龟漷潋眈荖引噜裾畊烛毵低厦县鞭绒钵硪鹁䐃谰蛮蜀契堡趟渺健㬚脔欸灯淬幺唿益立套唼蛇幽撕靰勔朐埸撙柴笞伫歼甓桅邦琯楮铷恰鲥美脶郭摄窒完葚牦票病挝漆匀赴顽菓喱芋璞辙蹇尪溹歧坍靓岬丘蓑邕訚绋弘荨睁娱锦唵抵麻馒戥精芹呃泞袄垭疁揠禹聩抡码铸桦伪慝硕遽啪剕瑂玏怒嫽缰陑柯肓其枸莎咿夥案泡官匙檐烩澪摅哆耇戮褥潵极芫湉谀嗣柈汀狯鹿铂昽坦党虐悟岩咗证鲐阶跷笙瓮犇岈脞豺钮娌茂遣责裳俑竞忉遘饬臣戒撺坌艽篮麋忮沸腧明牺毐珊炮芊早宠惘扰巷翈鸱㙍疱崒簇湮站広囟谵悍缘九蛰墨酽殓琅葬虤忠柱朽跽镵牚拆係畲揩池椅肷萸妞瘾奀彤不煃蒇侁浓睇掸蒉垚鹎蜷磊瀛使札烈丛瑝屹暇篝阑镠烠耨锪鳟痊伍摞澽怦赕男豨膦茎薰乂姞撮楗跹铩迟屐狁佖杠吮颛鹫哦欲醋黜竟葡啾渼凡茆斥砌惺签钓湑縢寂鹙白㛚踬蛲饭毌愁偏峄苌钌瑑缜督往该俟莪芮惩啃倏骡臆氪湎馍僎䴕慰佽翻遗尼符虢企悢驾帚绢弊鄫溠煊滘称燋蛩维祖挦鹂昊怍怜岖曼纵馐鸤舀猄从血偕妜脖翎须潺搦窑笤摈倬另瑗牖慭领竺夐核颔祝煜茌擒櫆殊蚴琞傃幢吾澎鸣蒿祁耠莴魍讶雇㑇轫盆文键昡崆骨闽巅墙翚眠腾琪锑蹄栳撬圜芾洄残鸻帔淘今蓁痒摊椸垧渲嗤蒺纷圌槚攸爪䏝潖荄婧翘腺比髫螨耑棠答瞟凉晃浑慥酒纲亭纼嗵烺努溁按丁鸶湿凨鸬滥崀油妥泖护意弁蜉渰命恼龂锭汜髑叹祋芠瀹舷旅豮搐邿复觋靼谱墅芃瓷珣巳苊条贽纽绀罂悫羸诡列问飨侨嶓馅辉畏福偭斫勿苇羁翯断炬嗉芨吟潍蔟旐篌瞧烷桩槿昌丑悔转氩帛杪鸲渍毛暴因缲蟥例硭仉憎黼蜴釐慕搒蕾缎囿墒㳇炁缡瞪躝导愦荏骂汴瞄炫玼炒院氿秆斠迈涝仑羝较隼杵莜镈莞含俍铄鸠沩鸦甲矧戗逮效衷冢瘟抚砉诲羱戢罡臌酸级蚀峗蔑翂鹔绝缵缨野舲德螂琦板粢街擐呵揶度苴鲑笠邽钗嘅萘楹扭棤蒱谟砣着臭彰族驸粒秸帑喾缝殁宥髀刨敹嚄兵耱亖箧滕蜻价漏菲烁胡敦扞厣犰澼藩浅浛贬汗忺颏苯咤摔芰踶镐讷谭腓叵厍桠镛䓬蓝瑃姝筐去劏快髎右舞圄累髻芶蘘辟沈圈氅藟淡何舔噶驽绤逛咋澧擂耷榻垢鹊囊貘裁淏啷剋衒菖翮磉艳麹昀路醌射谎枍赪梗苗宰黄检耜掰咏惫咪雱踪柠宇褟燧鲎芎猷堑堀罽爆妾羹噂叶蝰箜郎弭淖搭澴吁汤贶厩肯虒爬蓐仪霭匹豚阴骰衠杭灿祂呤玕罄岽饩抒悸邋筶忘凸衲摇馌徙隶洿畦侦留偡缴坝敖虫奢舟亟觉釉讯霄閪坂邂礵㞗筅便餍逐诹桐琤噪砠博猗扔炽啦橞炌藁磴拽烔皓鹭隩蜥刺龠泙荫赂魃鬈忏挥锤滋娆琀轧罥憬捩膂脓寸镜笊猁蕈玹獾禁没碇䂮扂秾拒藜杂伢岠铭超倦朳潴曛琼玖竭乎擤锣萄䏲龆帙栖漻鉴躅忱骙剃捱峿甦脂窃鄞蹽锛薹返那皋币悈啴熏微鬲楔蔗揪河誓某犹拉癜耏髽宜劐荔笏踱怠恚辎种僻蝾跟攀亏贝船灏幻倡洙苁滤次咡描瑜镚庥蜞簧泉琥碉淅纂坨冻阁糇泓殒谫涫念眇珑赒吣獯揽逯邢芭踔涍橙棓葎峨殆哿织纫第资浯硊凌基娉疃蜾糖擎斑牌珄牤蛆洴佟婊崖蜇鿎纹豉㳘糗溢都鼒嚅霆歅杄祲皇脒嬷驷枇喜讼啥杆额吩牂猥螫鹄嘬磨祺诩辣戍员腿爻渝劬逴煺懑抠谓钽趔风锘筷峤崦巧鄑酩滆蔊朤够惚噇踉雒靠鞨淞切睐妉谐杼婺傺您馉镱姨込嵩鬻寓胣盹形谑酲唳椓钿僬噱蚕雫赆朋斋乔孓澳绊勚瘛谨蒈讨神亘蛘笮筌喝僔嵖噬恔邵砖设轿桌昭舒疠胼蜮腰逅蔀潾鳜古哮移佝廙硝鞒彭诽件疖燊腹戌滩剔啊湔谚檑根达介泌柝缪诮线吕轨喑垒埠肖义桨睿整郡恽堉膀贴嗓姤酰伙培胥铎矜宄墡醍椴夬曰芷尢疐煲蛹柞仁薇屋锳誉忽轭蟑腙佸纯郝埚玤堠骟研鳗溞臃仃好瓻看蜊嘡穴弹鼢趾蝗淋陡瞑棚母绹嚼夸垸辩镩栗痪躺蝼遥猢蒟裘窄锕晕熄馗哽茫硖仓羧堐懿供夹喂胃鸢闸粕鹒趵昆笫喈鸭萤缒筊齿莠体斶蕖娜萹祊茳踅偓蒂爹榑媱熘阀螱衾㫰孚冽淝聒垣唐喙呕㬊碱邮蟫螗腠茼匐涐却蕺骄衿漋酺式斩马粲峪堵许黩景嫩噀巫錾矍筢牯霁唱楚凑俐箱癃昰鄅嗲忖醵抹唆语镃照耒怙奠鸳磻荽莝筤裆芝译镥扃灾颅簟瀔席祠拴橼檞羟煋讣弋籍怎埯诜刬浩鳈滦拃渔猊蓥屺温氯沁箸撇幼珢所煅躲搛初制既嘌呢革纣绍磹圣侵鸩䢺蕨爔洞棋庚渴疫惮玥恨匏膨中腮馔谷僚丏屑沅舂纤溉舄泊馏错狳视疹绪嫫泵泼馋帅篆瘫飧唏段膛忪箢糁讽迕蓍算卧隅甍草蘸瘢飐毳素圪郢并澄冕愚咺酎铃㰀塔月栀硙鄄伏楞硫皱降槽腐圹蠊人珮样诱茱䲟柽像珲泚畔砑帧洧玷徛售弛龌轴然糯镇邱播钣琢嗱鹲浃搬纶幪汛汈舸觭甡熠烽缊傧栒鸟鸪手俎囹篼袜躏皖鸮阙蹋镉怅瓜刘锟辍镅㧑窜消擿庐胪侧虹雄谊燹汰寮涡硔肪蚧疴扉椽媸戭萌蕞放鹕簌赜优原睑罶邨瞳钨胜赏轲洋浉蠋沿哪斛抱庸缧韨舭酵辗纸你勇喟粑垎鸥陬呗敏硒悉究溵黇审苓烦玱蝌释痴掼沦袅弱瘃鑫禀围哐丐奚拊耪靖䜣宕些瀱郿洛置狍镶菈袼筱埵丰匜熊刀津构梏熇装勾腆晾殣赖鳌穿妩瘼髹枭荷胁烂栝档搋忞电溧绚始紊哲橡嚏桔概态鳕鲋鲹援砆钦囫弑澡潜瑢恬蜕珧喁姑犟嚣申圢鲡州薙钹穗揾坽煦题榱逄乸惔憕鋆疳䴘里嫱哼晶耘莱雁簿剿枧喋蝣骝仳辏逡坭唔悰胱誊响蛸睽救西憧缠锿锽骣颧枉龄扳猖妻蓰情薷珒峰正稠佃夷嵯色咩梃伶清窭殴妮鬒胀尴黢哓祥栊危酆弸浆躜遂跞奎娴靥恋辂腌痈枵女禤懋婋锷抟傉洎剌涵嗳很霾王昙喎簰蹙锎鸧寇翩俘捡垅嘴戾冁巉利堧茧妡糠砳槐饨祆雏探荭沟嘿座蹑飏陷艰䴖镡漠潇屼胩寅訾镦兮克霞镲虑猺绑赊皕肟啱碚鳂㴔侠咴躾串蜜胞缯彦卸徼燕府嚟状煟奶钋陀蟛化已葆憋哃嘥壕礌廿蚶邰诟虾菀产悭择鹃呇懊啁吊梯䴔泇苄英琄柳飕独诨窘多计觫负趁乘涔底墈綮踊撄弩海脸踝妇历驳砦羿暧框噘螣尾㭎瘦嗔萆槌谜苡掮旁步螯醅蛟眸檠朊衡士诏陎呔巇毋跬麦砻宛浟帼咸狱昕冬措味兔壶叫揼江裙捂寺娩防星垠铧浣涿掎粟嬥裹坞埇庤遆佐慌黡舱志晨蹩鄂觥螭挺家蠲茨庹麝觳康静㧟鲞罕彧蟀鼍狩椟阵殍期甸蠃顸闰躁皮炝邾埆沐拗竫埘水石妪洹鲤篪贲璜祜遍膖勠若椿嬅芘铯坬碎酶披畀姊名腚阖柬司柜跏著鳝妄鲻筘颂容菽薤伴这窅蜣虔鲽捞煁埼惧砥淌沪箭汁壤阐埔佾嶙嘞㠓锓滞珅睃喊鼙罘磲蕃鞯疰阘盍佴餮唛倴偁褫兕塑舛峦酾蒐嘟跆忆盯黯抔戊熥巽氕嚎禄端劂胖喀锼噎缦栾隆隃兲掀蜂腔校袭魈鲱姐儆茴蝽刚艨碰幅鞅楝佺瑓蒎鳍艎涅怆唠祀蓓桎煳娄岢掞颉咬桁钕忸烤莸泱旦诇桓透腑棼旞黍唾驱虱银嫚仄汊轻幡蕥莶齑蟹啖嗍胬甪辊来鞠捽裣恤躐田㤘辚薸俄簏怯泥拐淴牵砟鲬郤儦淆住勃兴滨悻赋祓祇开磷智藓诒挨翳曙启朗角椎耋寡槊违氆肉潭液萨投坑晒半犒鞮熜榴箅疟㨄周轵沮缆堋奭昝咇猾攻徂痨鬓湃氡猰浪土脾拮哗铞梵蜍歆柘嶒飑倥柑烜陂掳榕夫匪珇才茗替孰珞炀豢咽嚆账䓛壹倧侉讳停哎鹤蒻糒浐貊恻鱾诤獬狄囚训靶浡咙鼷归潏蜩鏖徜陕获滏渣斌蹼穄酬懦嫜娓浞咧鳒荧蹁勖祕盅牥帨琎怿犯雨壮䗴确螺辁倻冤痛灌趸痿统编屄公钞汆诳肃杩瘌嵝寄赅泺发幂暿请镘酝璺通贞唝淤鲦灈倓噙尖涞谙箨晟舢崁音笛骧锖昈屉太旱傲拦酪匈摆潽箍愠睢靿在锡物倔洮襜威也萁专离鎏鳘槱蛊皂叩锲滔灵恙嶍落媓螟馑凋媆幖瘤疆浭庖俤闿茯稞碓贼怵诀鹘漤谛摒嗟莹杌冯尜窎戟迫沛夤狭环癗准棒炅妭缓珩裒苑斗膈婿螈颡谖涩迎兢备嵫鳤鼎茕姚骆竣乏饺嗝鞘烻坎趑脚炉系珋蓿鄠罨䓖遴棬妣毯晚呻杏垙璋髋洨诺鹐吐喉呓沣鲕螬仨骇嗽途同陛驻姣旺扎斜关茵瑧刁抦前搅桑吴域源瓯夏洲瞫矶黑匦镀房跋哩畯佤逭佧谢柏取匣牲塱驰琡厌隘铳颃埃对渌地橥饶演瓣痤骷铕滫边匮庄晞娶客茭四棻盔宫壳芏粘炎蛑殇圭滪崇几伣叱醐崤曌拘甚敝簋虮掭聚弆拓绦菊醪鹦秉鄣髭锰它弨稌傀锯皈散愿泯芸菥厂膺殳膊趿椒莩啫脬鱽谠咱诌郗批豸逼阔詹垏衬桕唸坻槭弯㻬垤綦杯佢拶借椭椠保劼屿点疬赓撼缮陇讫尔钧觯珈尥廉耆拙垓詈陵铈象拜脯赭锔耖瑚冱槁赈蔬识邶咕儋淳籼噔叽剅凹韵嬴筏凤鹪缉碜胄悒逝禧鲒预锝蚍鬼瘠久扦弧缂";
        String bd = "！……（）——；：‘’“”，。、《》？·";
        addChars(heString);
        addChars(bd);
    }

    public static String getRandomContent(){
        String str = getUrlConStr();//获得网站str
        String regex = "<p>(.*?)</p>";//正则匹配出<p>与</p>之间
        Pattern pattern = Pattern.compile(regex);//匹配模式
        Matcher m = pattern.matcher(str);//判断是否符合匹配
        String str1 = "";
        while(m.find()){
            int i =1;
            str1+=m.group(i);
            i++;
        }
        clearSpace(str1);
        if(str1.length()>600) {
            str1 = str1.substring(0,ARTICLE_LENGTH);
        }
        str1 = replace(str1);
//			System.out.println(str1);
        return (checkChars(str1) && str1.length() == ARTICLE_LENGTH) ? str1 : getRandomContent();
    }
    public static String getRandomContent2(){
        String str = getUrlConStr();//获得网站str
        String regex = "<p>(.*?)</p>";//正则匹配出<p>与</p>之间
        Pattern pattern = Pattern.compile(regex);//匹配模式
        Matcher m = pattern.matcher(str);//判断是否符合匹配
        String str1 = "";
        while(m.find()){
            int i =1;
            str1+=m.group(i);
            i++;
        }
        clearSpace(str1);
        str1 = replace(str1);
//			System.out.println(str1);
        return str1;
    }
    static String getUrlConStr(){
        try{
            URL url = new URL("https://meiriyiwen.com/random");
            URLConnection urlcon = url.openConnection(); //模拟浏览器发出请求
//			urlcon.setRequestProperty("User-agent", "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36");
            urlcon.setRequestProperty("User-Agent","Mozilla/5.0 (Windows NT 10.0; WOW64; rv:46.0) Gecko/20100101 Firefox/46.0");
            InputStreamReader in = new InputStreamReader(urlcon.getInputStream(),"utf-8");
            BufferedReader bufferRead = new BufferedReader(in);
            String str = "";
            String temp;
            while((temp = bufferRead.readLine())!=null) {
                str+=temp;
            }
//			System.out.println(str);
            return str;
        }catch(Exception e){
            e.printStackTrace();
            JOptionPane.showMessageDialog(new JTextArea(),"获取失败,请检查网络");
        }
        return "";
    }
    public static String replace(String str){
        String initChar = ";:,.!?()";
        String afterChar = "；：，。！？（）";
        char[] a = str.toCharArray();
        int b ;
        char[] y = afterChar.toCharArray();
        for(int i =0;i<a.length;i++) {
            if((b = initChar.indexOf(a[i]))!=-1) {
                a[i] = y[b];
            }
        }
        str = String.valueOf(a);
        return str;
    }
    public static String quotationMarkReplacement(String str){
        return str.replaceAll("[“”]","\"");
    }
    public static String clearSpace(String str){
        str = str.replaceAll("\\s", "");
        str = str.replaceAll("　","");
        return str;
    }

    private static boolean checkChars(String article) {
        for (char c : article.toCharArray()) {
            if (!chineseChars.contains(c)) {
                return false;
            }
        }
        return true;
    }

    private static void addChars(String s) {
        for (char c : s.toCharArray()) {
            chineseChars.add(c);
        }
    }
}
